RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/iso11898_reg.h
/* 0x10 : op mode:rw        reset mode:rw      when be read,all bits are reseted and iso11898_int disappear */
#define ISO11898_INTERRUPT_ENABLE_OFFSET   (0x10)
#define ISO11898_RECEIVE_INT_EN            ISO11898_RECEIVE_INT_EN
#define ISO11898_RECEIVE_INT_EN_POS        (0U)
#define ISO11898_RECEIVE_INT_EN_LEN        (1U)
#define ISO11898_RECEIVE_INT_EN_MSK        (((1U << ISO11898_RECEIVE_INT_EN_LEN) - 1) << ISO11898_RECEIVE_INT_EN_POS)
#define ISO11898_RECEIVE_INT_EN_UMSK       (~(((1U << ISO11898_RECEIVE_INT_EN_LEN) - 1) << ISO11898_RECEIVE_INT_EN_POS))
#define ISO11898_TRANSMIT_INT_EN           ISO11898_TRANSMIT_INT_EN
#define ISO11898_TRANSMIT_INT_EN_POS       (1U)
#define ISO11898_TRANSMIT_INT_EN_LEN       (1U)
#define ISO11898_TRANSMIT_INT_EN_MSK       (((1U << ISO11898_TRANSMIT_INT_EN_LEN) - 1) << ISO11898_TRANSMIT_INT_EN_POS)
#define ISO11898_TRANSMIT_INT_EN_UMSK      (~(((1U << ISO11898_TRANSMIT_INT_EN_LEN) - 1) << ISO11898_TRANSMIT_INT_EN_POS))
#define ISO11898_ERROR_INT_EN              ISO11898_ERROR_INT_EN
#define ISO11898_ERROR_INT_EN_POS          (2U)
#define ISO11898_ERROR_INT_EN_LEN          (1U)
#define ISO11898_ERROR_INT_EN_MSK          (((1U << ISO11898_ERROR_INT_EN_LEN) - 1) << ISO11898_ERROR_INT_EN_POS)
#define ISO11898_ERROR_INT_EN_UMSK         (~(((1U << ISO11898_ERROR_INT_EN_LEN) - 1) << ISO11898_ERROR_INT_EN_POS))
#define ISO11898_DATA_OVERRUN_INT_EN       ISO11898_DATA_OVERRUN_INT_EN
#define ISO11898_DATA_OVERRUN_INT_EN_POS   (3U)
#define ISO11898_DATA_OVERRUN_INT_EN_LEN   (1U)
#define ISO11898_DATA_OVERRUN_INT_EN_MSK   (((1U << ISO11898_DATA_OVERRUN_INT_EN_LEN) - 1) << ISO11898_DATA_OVERRUN_INT_EN_POS)
#define ISO11898_DATA_OVERRUN_INT_EN_UMSK  (~(((1U << ISO11898_DATA_OVERRUN_INT_EN_LEN) - 1) << ISO11898_DATA_OVERRUN_INT_EN_POS))
#define ISO11898_ERROR_PASSIVE_INT_EN      ISO11898_ERROR_PASSIVE_INT_EN
#define ISO11898_ERROR_PASSIVE_INT_EN_POS  (5U)
#define ISO11898_ERROR_PASSIVE_INT_EN_LEN  (1U)
#define ISO11898_ERROR_PASSIVE_INT_EN_MSK  (((1U << ISO11898_ERROR_PASSIVE_INT_EN_LEN) - 1) << ISO11898_ERROR_PASSIVE_INT_EN_POS)
#define ISO11898_ERROR_PASSIVE_INT_EN_UMSK (~(((1U << ISO11898_ERROR_PASSIVE_INT_EN_LEN) - 1) << ISO11898_ERROR_PASSIVE_INT_EN_POS))
#define ISO11898_ARB_LOST_INT_EN           ISO11898_ARB_LOST_INT_EN
#define ISO11898_ARB_LOST_INT_EN_POS       (6U)
#define ISO11898_ARB_LOST_INT_EN_LEN       (1U)
#define ISO11898_ARB_LOST_INT_EN_MSK       (((1U << ISO11898_ARB_LOST_INT_EN_LEN) - 1) << ISO11898_ARB_LOST_INT_EN_POS)
#define ISO11898_ARB_LOST_INT_EN_UMSK      (~(((1U << ISO11898_ARB_LOST_INT_EN_LEN) - 1) << ISO11898_ARB_LOST_INT_EN_POS))
#define ISO11898_BUS_ERROR_INT_EN          ISO11898_BUS_ERROR_INT_EN
#define ISO11898_BUS_ERROR_INT_EN_POS      (7U)
#define ISO11898_BUS_ERROR_INT_EN_LEN      (1U)
#define ISO11898_BUS_ERROR_INT_EN_MSK      (((1U << ISO11898_BUS_ERROR_INT_EN_LEN) - 1) << ISO11898_BUS_ERROR_INT_EN_POS)
#define ISO11898_BUS_ERROR_INT_EN_UMSK     (~(((1U << ISO11898_BUS_ERROR_INT_EN_LEN) - 1) << ISO11898_BUS_ERROR_INT_EN_POS))

/* 0x18 : op mode:r   reset mode:rw */
#define ISO11898_BUS_TIMING_0_OFFSET      (0x18)
#define ISO11898_BAUD_RATE_PRESCALER      ISO11898_BAUD_RATE_PRESCALER
#define ISO11898_BAUD_RATE_PRESCALER_POS  (0U)
#define ISO11898_BAUD_RATE_PRESCALER_LEN  (6U)
#define ISO11898_BAUD_RATE_PRESCALER_MSK  (((1U << ISO11898_BAUD_RATE_PRESCALER_LEN) - 1) << ISO11898_BAUD_RATE_PRESCALER_POS)
#define ISO11898_BAUD_RATE_PRESCALER_UMSK (~(((1U << ISO11898_BAUD_RATE_PRESCALER_LEN) - 1) << ISO11898_BAUD_RATE_PRESCALER_POS))
#define ISO11898_SYNC_JUMP_WIDTH          ISO11898_SYNC_JUMP_WIDTH
#define ISO11898_SYNC_JUMP_WIDTH_POS      (6U)
#define ISO11898_SYNC_JUMP_WIDTH_LEN      (2U)
#define ISO11898_SYNC_JUMP_WIDTH_MSK      (((1U << ISO11898_SYNC_JUMP_WIDTH_LEN) - 1) << ISO11898_SYNC_JUMP_WIDTH_POS)
#define ISO11898_SYNC_JUMP_WIDTH_UMSK     (~(((1U << ISO11898_SYNC_JUMP_WIDTH_LEN) - 1) << ISO11898_SYNC_JUMP_WIDTH_POS))

/* 0x1c : op mode:r  reset mode:rw */
#define ISO11898_BUS_TIMING_1_OFFSET (0x1c)
#define ISO11898_TIME_SEGMENT_1      ISO11898_TIME_SEGMENT_1
#define ISO11898_TIME_SEGMENT_1_POS  (0U)
#define ISO11898_TIME_SEGMENT_1_LEN  (4U)
#define ISO11898_TIME_SEGMENT_1_MSK  (((1U << ISO11898_TIME_SEGMENT_1_LEN) - 1) << ISO11898_TIME_SEGMENT_1_POS)
#define ISO11898_TIME_SEGMENT_1_UMSK (~(((1U << ISO11898_TIME_SEGMENT_1_LEN) - 1) << ISO11898_TIME_SEGMENT_1_POS))
#define ISO11898_TIME_SEGMENT_2      ISO11898_TIME_SEGMENT_2
#define ISO11898_TIME_SEGMENT_2_POS  (4U)
#define ISO11898_TIME_SEGMENT_2_LEN  (3U)
#define ISO11898_TIME_SEGMENT_2_MSK  (((1U << ISO11898_TIME_SEGMENT_2_LEN) - 1) << ISO11898_TIME_SEGMENT_2_POS)
#define ISO11898_TIME_SEGMENT_2_UMSK (~(((1U << ISO11898_TIME_SEGMENT_2_LEN) - 1) << ISO11898_TIME_SEGMENT_2_POS))
#define ISO11898_SAMPLING            ISO11898_SAMPLING
#define ISO11898_SAMPLING_POS        (7U)
#define ISO11898_SAMPLING_LEN        (1U)
#define ISO11898_SAMPLING_MSK        (((1U << ISO11898_SAMPLING_LEN) - 1) << ISO11898_SAMPLING_POS)
#define ISO11898_SAMPLING_UMSK       (~(((1U << ISO11898_SAMPLING_LEN) - 1) << ISO11898_SAMPLING_POS))

/* 0x2c : op mode:r       reset mode:r */
#define ISO11898_ARB_LOST_CAPTURE_OFFSET (0x2c)
#define ISO11898_ALC4_0                  ISO11898_ALC4_0
#define ISO11898_ALC4_0_POS              (0U)
#define ISO11898_ALC4_0_LEN              (5U)
#define ISO11898_ALC4_0_MSK              (((1U << ISO11898_ALC4_0_LEN) - 1) << ISO11898_ALC4_0_POS)
#define ISO11898_ALC4_0_UMSK             (~(((1U << ISO11898_ALC4_0_LEN) - 1) << ISO11898_ALC4_0_POS))

/* 0x30 : op mode:r      reset mode:r */
#define ISO11898_ERROR_CODE_CAPTURE_OFFSET (0x30)
#define ISO11898_SEGMENT4_0                ISO11898_SEGMENT4_0
#define ISO11898_SEGMENT4_0_POS            (0U)
#define ISO11898_SEGMENT4_0_LEN            (5U)
#define ISO11898_SEGMENT4_0_MSK            (((1U << ISO11898_SEGMENT4_0_LEN) - 1) << ISO11898_SEGMENT4_0_POS)
#define ISO11898_SEGMENT4_0_UMSK           (~(((1U << ISO11898_SEGMENT4_0_LEN) - 1) << ISO11898_SEGMENT4_0_POS))
#define ISO11898_DIR                       ISO11898_DIR
#define ISO11898_DIR_POS                   (5U)
#define ISO11898_DIR_LEN                   (1U)
#define ISO11898_DIR_MSK                   (((1U << ISO11898_DIR_LEN) - 1) << ISO11898_DIR_POS)
#define ISO11898_DIR_UMSK                  (~(((1U << ISO11898_DIR_LEN) - 1) << ISO11898_DIR_POS))
#define ISO11898_ERR_CODE                  ISO11898_ERR_CODE
#define ISO11898_ERR_CODE_POS              (6U)
#define ISO11898_ERR_CODE_LEN              (2U)
#define ISO11898_ERR_CODE_MSK              (((1U << ISO11898_ERR_CODE_LEN) - 1) << ISO11898_ERR_CODE_POS)
#define ISO11898_ERR_CODE_UMSK             (~(((1U << ISO11898_ERR_CODE_LEN) - 1) << ISO11898_ERR_CODE_POS))

/* 0x34 : op mode:r     reset mode:rw */
#define ISO11898_ERROR_WARNING_LIMIT_OFFSET (0x34)
#define ISO11898_ERR_WARNING_LIMIT          ISO11898_ERR_WARNING_LIMIT
#define ISO11898_ERR_WARNING_LIMIT_POS      (0U)
#define ISO11898_ERR_WARNING_LIMIT_LEN      (8U)
#define ISO11898_ERR_WARNING_LIMIT_MSK      (((1U << ISO11898_ERR_WARNING_LIMIT_LEN) - 1) << ISO11898_ERR_WARNING_LIMIT_POS)
#define ISO11898_ERR_WARNING_LIMIT_UMSK     (~(((1U << ISO11898_ERR_WARNING_LIMIT_LEN) - 1) << ISO11898_ERR_WARNING_LIMIT_POS))

/* 0x38 : op mode:r     reset mode:rw */
#define ISO11898_RX_ERR_COUNT_OFFSET (0x38)
#define ISO11898_RX_ERR_CNT          ISO11898_RX_ERR_CNT
#define ISO11898_RX_ERR_CNT_POS      (0U)
#define ISO11898_RX_ERR_CNT_LEN      (8U)
#define ISO11898_RX_ERR_CNT_MSK      (((1U << ISO11898_RX_ERR_CNT_LEN) - 1) << ISO11898_RX_ERR_CNT_POS)
#define ISO11898_RX_ERR_CNT_UMSK     (~(((1U << ISO11898_RX_ERR_CNT_LEN) - 1) << ISO11898_RX_ERR_CNT_POS))

