RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/iso11898_reg.h
/* 0x3c : op mode:r      reset mode:rw */
#define ISO11898_TX_ERR_COUNT_OFFSET (0x3c)
#define ISO11898_TX_ERR_CNT          ISO11898_TX_ERR_CNT
#define ISO11898_TX_ERR_CNT_POS      (0U)
#define ISO11898_TX_ERR_CNT_LEN      (8U)
#define ISO11898_TX_ERR_CNT_MSK      (((1U << ISO11898_TX_ERR_CNT_LEN) - 1) << ISO11898_TX_ERR_CNT_POS)
#define ISO11898_TX_ERR_CNT_UMSK     (~(((1U << ISO11898_TX_ERR_CNT_LEN) - 1) << ISO11898_TX_ERR_CNT_POS))

/* 0x40 : op mode: w  ->  tx_frm_info
                r   ->  rx_frm_info
reset mode:rw  -> acceptance_code0 */
#define ISO11898_TXRX_FRM_INFO_OR_ACCEPTANCE_CODE0_OFFSET (0x40)
#define ISO11898_TXRX_FRM_INFO_OR_ACCEPTANCE_CODE0        ISO11898_TXRX_FRM_INFO_OR_ACCEPTANCE_CODE0
#define ISO11898_TXRX_FRM_INFO_OR_ACCEPTANCE_CODE0_POS    (0U)
#define ISO11898_TXRX_FRM_INFO_OR_ACCEPTANCE_CODE0_LEN    (8U)
#define ISO11898_TXRX_FRM_INFO_OR_ACCEPTANCE_CODE0_MSK    (((1U << ISO11898_TXRX_FRM_INFO_OR_ACCEPTANCE_CODE0_LEN) - 1) << ISO11898_TXRX_FRM_INFO_OR_ACCEPTANCE_CODE0_POS)
#define ISO11898_TXRX_FRM_INFO_OR_ACCEPTANCE_CODE0_UMSK   (~(((1U << ISO11898_TXRX_FRM_INFO_OR_ACCEPTANCE_CODE0_LEN) - 1) << ISO11898_TXRX_FRM_INFO_OR_ACCEPTANCE_CODE0_POS))

/* 0x44 : op mode:w  ->  tx_id1
               r   ->  rx_id1
reset mode:rw  ->  acceptance_code1 */
#define ISO11898_TXRX_ID1_OR_ACCEPTANCE_CODE1_OFFSET (0x44)
#define ISO11898_TXRX_ID1_OR_ACCEPTANCE_CODE1        ISO11898_TXRX_ID1_OR_ACCEPTANCE_CODE1
#define ISO11898_TXRX_ID1_OR_ACCEPTANCE_CODE1_POS    (0U)
#define ISO11898_TXRX_ID1_OR_ACCEPTANCE_CODE1_LEN    (8U)
#define ISO11898_TXRX_ID1_OR_ACCEPTANCE_CODE1_MSK    (((1U << ISO11898_TXRX_ID1_OR_ACCEPTANCE_CODE1_LEN) - 1) << ISO11898_TXRX_ID1_OR_ACCEPTANCE_CODE1_POS)
#define ISO11898_TXRX_ID1_OR_ACCEPTANCE_CODE1_UMSK   (~(((1U << ISO11898_TXRX_ID1_OR_ACCEPTANCE_CODE1_LEN) - 1) << ISO11898_TXRX_ID1_OR_ACCEPTANCE_CODE1_POS))

/* 0x48 : op mode:w   ->  tx_id2
                r   ->  rx_id2
 reset mode:rw ->  acceptance_code2 */
#define ISO11898_TXRX_ID2_OR_ACCEPTANCE_CODE2_OFFSET (0x48)
#define ISO11898_TXRX_ID2_OR_ACCEPTANCE_CODE2        ISO11898_TXRX_ID2_OR_ACCEPTANCE_CODE2
#define ISO11898_TXRX_ID2_OR_ACCEPTANCE_CODE2_POS    (0U)
#define ISO11898_TXRX_ID2_OR_ACCEPTANCE_CODE2_LEN    (8U)
#define ISO11898_TXRX_ID2_OR_ACCEPTANCE_CODE2_MSK    (((1U << ISO11898_TXRX_ID2_OR_ACCEPTANCE_CODE2_LEN) - 1) << ISO11898_TXRX_ID2_OR_ACCEPTANCE_CODE2_POS)
#define ISO11898_TXRX_ID2_OR_ACCEPTANCE_CODE2_UMSK   (~(((1U << ISO11898_TXRX_ID2_OR_ACCEPTANCE_CODE2_LEN) - 1) << ISO11898_TXRX_ID2_OR_ACCEPTANCE_CODE2_POS))

/* 0x74 : op mode:r    reset mode:r */
#define ISO11898_RX_MESSAGE_COUNT_OFFSET (0x74)
#define ISO11898_RX_MESSAGE_CNT          ISO11898_RX_MESSAGE_CNT
#define ISO11898_RX_MESSAGE_CNT_POS      (0U)
#define ISO11898_RX_MESSAGE_CNT_LEN      (5U)
#define ISO11898_RX_MESSAGE_CNT_MSK      (((1U << ISO11898_RX_MESSAGE_CNT_LEN) - 1) << ISO11898_RX_MESSAGE_CNT_POS)
#define ISO11898_RX_MESSAGE_CNT_UMSK     (~(((1U << ISO11898_RX_MESSAGE_CNT_LEN) - 1) << ISO11898_RX_MESSAGE_CNT_POS))

/* 0x7c : op mode:rw       reset mode:rw    iso11898_mode and cbp can be write in reset mode only */
#define ISO11898_CLOCK_DIVIDER_OFFSET (0x7c)
#define ISO11898_CD                   ISO11898_CD
#define ISO11898_CD_POS               (0U)
#define ISO11898_CD_LEN               (3U)
#define ISO11898_CD_MSK               (((1U << ISO11898_CD_LEN) - 1) << ISO11898_CD_POS)
#define ISO11898_CD_UMSK              (~(((1U << ISO11898_CD_LEN) - 1) << ISO11898_CD_POS))
#define ISO11898_CLOCKOFF             ISO11898_CLOCKOFF
#define ISO11898_CLOCKOFF_POS         (3U)
#define ISO11898_CLOCKOFF_LEN         (1U)
#define ISO11898_CLOCKOFF_MSK         (((1U << ISO11898_CLOCKOFF_LEN) - 1) << ISO11898_CLOCKOFF_POS)
#define ISO11898_CLOCKOFF_UMSK        (~(((1U << ISO11898_CLOCKOFF_LEN) - 1) << ISO11898_CLOCKOFF_POS))
#define ISO11898_READONLY             ISO11898_READONLY
#define ISO11898_READONLY_POS         (4U)
#define ISO11898_READONLY_LEN         (1U)
#define ISO11898_READONLY_MSK         (((1U << ISO11898_READONLY_LEN) - 1) << ISO11898_READONLY_POS)
#define ISO11898_READONLY_UMSK        (~(((1U << ISO11898_READONLY_LEN) - 1) << ISO11898_READONLY_POS))
#define ISO11898_RXINTEN              ISO11898_RXINTEN
#define ISO11898_RXINTEN_POS          (5U)
#define ISO11898_RXINTEN_LEN          (1U)
#define ISO11898_RXINTEN_MSK          (((1U << ISO11898_RXINTEN_LEN) - 1) << ISO11898_RXINTEN_POS)
#define ISO11898_RXINTEN_UMSK         (~(((1U << ISO11898_RXINTEN_LEN) - 1) << ISO11898_RXINTEN_POS))
#define ISO11898_CBP                  ISO11898_CBP
#define ISO11898_CBP_POS              (6U)
#define ISO11898_CBP_LEN              (1U)
#define ISO11898_CBP_MSK              (((1U << ISO11898_CBP_LEN) - 1) << ISO11898_CBP_POS)
#define ISO11898_CBP_UMSK             (~(((1U << ISO11898_CBP_LEN) - 1) << ISO11898_CBP_POS))
#define ISO11898_MODE                 ISO11898_MODE
#define ISO11898_MODE_POS             (7U)
#define ISO11898_MODE_LEN             (1U)
#define ISO11898_MODE_MSK             (((1U << ISO11898_MODE_LEN) - 1) << ISO11898_MODE_POS)
#define ISO11898_MODE_UMSK            (~(((1U << ISO11898_MODE_LEN) - 1) << ISO11898_MODE_POS))

/* 0x40 : Frame information */
#define ISO11898_INFORMATION_OFFSET (0x40)
#define ISO11898_INF_DLC            ISO11898_INF_DLC
#define ISO11898_INF_DLC_POS        (0U)
#define ISO11898_INF_DLC_LEN        (4U)
#define ISO11898_INF_DLC_MSK        (((1U << ISO11898_INF_DLC_LEN) - 1) << ISO11898_INF_DLC_POS)
#define ISO11898_INF_DLC_UMSK       (~(((1U << ISO11898_INF_DLC_LEN) - 1) << ISO11898_INF_DLC_POS))
#define ISO11898_INF_RTR            ISO11898_INF_RTR
#define ISO11898_INF_RTR_POS        (6U)
#define ISO11898_INF_RTR_LEN        (1U)
#define ISO11898_INF_RTR_MSK        (((1U << ISO11898_INF_RTR_LEN) - 1) << ISO11898_INF_RTR_POS)
#define ISO11898_INF_RTR_UMSK       (~(((1U << ISO11898_INF_RTR_LEN) - 1) << ISO11898_INF_RTR_POS))
#define ISO11898_INF_FF             ISO11898_INF_FF
#define ISO11898_INF_FF_POS         (7U)
#define ISO11898_INF_FF_LEN         (1U)
#define ISO11898_INF_FF_MSK         (((1U << ISO11898_INF_FF_LEN) - 1) << ISO11898_INF_FF_POS)
#define ISO11898_INF_FF_UMSK        (~(((1U << ISO11898_INF_FF_LEN) - 1) << ISO11898_INF_FF_POS))

/* 0x44 : Identifier 1, ID28~21 */
#define ISO11898_IDENTIFIER_1_OFFSET (0x44)

